rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
    /* Reply Message Data */
    cmd->arg.param1.U = MAKEREV(FIRMWARE_VER, FIRMWARE_REV);    /* STC version */
    cmd->arg.param2.U = dtc_version;                            /* DTC version */
    cmd->arg.bitflags = 0;

    return rc;
}


uint16_t HandleStop(int fd, STC_COMMAND_STOP* cmd)
{
    /* Cancel an locate in progress */
    if (IsLocating())
        LocateCancel();

    /* Send STOP button press */
    Transport_PostButtonPress(S_STOP);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_STOP);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleRew(int fd, STC_COMMAND_REW* cmd)
{
    uint32_t mask = S_REW;

    /* param1: flags STC_M_LIBWIND
     * param2: not used, zero
     */
    if (IsLocating())
        LocateCancel();

    /* simulate REC+FWD for lib wind mode */
    if (cmd->arg.param1.U & STC_M_LIBWIND)
        mask |= S_REC;

    Transport_PostButtonPress(mask);
    //Transport_Rew(0, msg.param1);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_REW);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleFwd(int fd, STC_COMMAND_FWD* cmd)
{
    uint32_t mask = S_FWD;

    /* param1: flags STC_M_LIBWIND
     * param2: not used, zero
     */
    if (IsLocating())
        LocateCancel();

    /* simulate REC+FWD for lib wind mode */
    if (cmd->arg.param1.U & STC_M_LIBWIND)
        mask |= S_REC;

    Transport_PostButtonPress(mask);
    //Transport_Fwd(0, msg.param1);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_FWD);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandlePlay(int fd, STC_COMMAND_PLAY* cmd)
{
    /* param1: 1=play+record, 0=play mode
     * param2: not used, zero
     */
    if (IsLocating())
        LocateCancel();

    if (cmd->arg.param1.U == 1)
        Transport_PostButtonPress(S_PLAY|S_REC);
    else
        Transport_PostButtonPress(S_PLAY);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_PLAY);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleLifter(int fd, STC_COMMAND_LIFTER* cmd)
{
    /* param1: not used, zero
     * param2: not used, zero
     */
    Transport_PostButtonPress(S_LDEF);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_LIFTER);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleLocateModeSet(int fd, STC_COMMAND_LOCATE_MODE_SET* cmd)
{
    /* param1: 1=store-mode, 0=cue-mode
     * param2: not used, zero
     */
    Remote_PostSwitchPress((cmd->arg.param1.U == 1) ? SW_STORE : SW_CUE, 0);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_LOCATE_MODE_SET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleLocate(int fd, STC_COMMAND_LOCATE* cmd)
{
    size_t      index;
    uint32_t    flags;

    // Start the auto-locator for the cue point index given
    /* param1: cue point index (0-9)
     * param2: cue flags, STC_CF_AUTO_PLAY or STC_CF_AUTO_REC
     */
    if (IsLocating())
        LocateCancel();

    index = 0;

    flags = cmd->arg.param2.U;

    switch(cmd->arg.param1.U)
    {
    case  STC_CUE_POINT_HOME:
        index = CUE_POINT_HOME;
        break;

    case STC_CUE_POINT_MARK_IN:
        index = CUE_POINT_MARK_IN;
        break;

    case STC_CUE_POINT_MARK_OUT:
        index = CUE_POINT_MARK_OUT;
        break;

    case STC_CUE_POINT_PUNCH_IN:
        index = CUE_POINT_PUNCH_IN;
        break;

    case STC_CUE_POINT_PUNCH_OUT:
        index = CUE_POINT_PUNCH_OUT;
        break;

    default:
        index = (cmd->arg.param1.U <= 9) ? cmd->arg.param1.U : 0;
        break;
    }

    //SetLocateButtonLED(index);
    LocateSearch(index, flags);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_LOCATE);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleCuePointStore(int fd, STC_COMMAND_CUEPOINT_STORE* cmd)
{
    int         ipos;
    size_t      index;
    uint32_t    flags;

    /* Index into cue table or track table */
    index = (size_t)cmd->hdr.index;

    /* param1: tape position
     * param2: cue flags (CF_ACTIVE, etc)
     */
    if (cmd->arg.param1.I == -1)
        ipos = g_sys.tapePosition;
    else
        ipos = cmd->arg.param1.I;

    flags = cmd->arg.param2.U;

    if (index == STC_CUE_POINT_MARK_IN)
    {
        SetButtonLedMask(STC_L_MARK_IN, 0);
        CuePointSet(index, ipos, flags);
    }
    else if (index == STC_CUE_POINT_MARK_OUT)
    {
        SetButtonLedMask(STC_L_MARK_OUT, 0);
        CuePointSet(index, ipos, flags);
    }
    else if (index == STC_CUE_POINT_PUNCH_IN)
    {
        SetButtonLedMask(STC_L_PUNCH_IN, 0);
        CuePointSet(index, ipos, flags);
    }
    else if (index == STC_CUE_POINT_PUNCH_OUT)
    {
        SetButtonLedMask(STC_L_PUNCH_OUT, 0);
        CuePointSet(index, ipos, flags);
    }
    else if (index <= 9)
    {
        SetLocateButtonLED(index);
        //SetButtonLedMask(smask[index] , 0);
        CuePointSet(index, ipos, flags);
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_CUEPOINT_STORE);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

