rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleCuePointSet(int fd, STC_COMMAND_CUEPOINT_SET* cmd)
{
    /* Index into cue table or track table */
    size_t index = (size_t)cmd->hdr.index;

    /* param1: tape position
     * param2: cue flags (CF_ACTIVE, etc)
     */
    CuePointSet(index, cmd->arg.param1.I, cmd->arg.param2.U);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_CUEPOINT_SET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleCuePointGet(int fd, STC_COMMAND_CUEPOINT_GET* cmd)
{
    int ipos;
    uint32_t flags;

    /* param1: cue point index
     * param2: not used, zero
     */
    CuePointGet((size_t)cmd->arg.param1.U, &ipos, &flags);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_CUEPOINT_GET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.I = ipos;       /* return position in param1 */
    cmd->arg.param2.U = flags;      /* return flags in param2    */
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleCuePointClear(int fd, STC_COMMAND_CUEPOINT_CLEAR* cmd)
{
    /* param1: cue point index, or -1 for all cue points
     * param2: not used, zero
     */
    if (cmd->arg.param1.U == STC_ALL_CUEPOINTS)
    {
        /* Clear all points 0-9 */
        CuePointClearAll();

        /* Clear loop mark in/out points */
        CuePointClear(CUE_POINT_MARK_IN);
        CuePointClear(CUE_POINT_MARK_OUT);

        /* Clear punch in/out points */
        CuePointClear(CUE_POINT_PUNCH_IN);
        CuePointClear(CUE_POINT_PUNCH_OUT);

        SetButtonLedMask(0, STC_L_LOC_MASK |
                            STC_L_MARK_IN  | STC_L_MARK_OUT |
                            STC_L_PUNCH_IN | STC_L_PUNCH_OUT);
    }
    else
    {
        CuePointClear((size_t)cmd->arg.param1.U);
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_CUEPOINT_CLEAR);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleLocateAutoLoop(int fd, STC_COMMAND_LOCATE_AUTO_LOOP* cmd)
{
    bool status;

    /* param1: cue flags, CF_AUTO_PLAY, etc
     * param2: not used, zero
     */
    if (IsLocating())
        LocateCancel();

    status = LocateLoop((uint32_t)cmd->arg.param1.U);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_CUEPOINT_CLEAR);
    cmd->hdr.index  = 0;
    cmd->hdr.status = (uint16_t)status;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleAutoPunchSet(int fd, STC_COMMAND_AUTO_PUNCH_SET* cmd)
{
    if (cmd->arg.param1.U)
    {
        SetButtonLedMask(STC_L_AUTO_PUNCH, 0);

        g_sys.autoPunch = TRUE;
    }
    else
    {
        SetButtonLedMask(0, STC_L_AUTO_PUNCH);

        g_sys.autoPunch = FALSE;
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_AUTO_PUNCH_SET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleAutoPunchGet(int fd, STC_COMMAND_AUTO_PUNCH_GET* cmd)
{
    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_AUTO_PUNCH_GET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = g_sys.autoPunch;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTrackSetState(int fd, STC_COMMAND_TRACK_SET_STATE* cmd)
{
    /* param1: index or -1 for all tracks
     * param2: track state bits
     */
    if (cmd->arg.param1.U == STC_ALL_TRACKS)
        Track_SetAll((uint8_t)cmd->arg.param2.U, 0);
    else
        Track_SetState((size_t)cmd->arg.param1.U, (uint8_t)cmd->arg.param2.U);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TRACK_SET_STATE);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTrackGetState(int fd, STC_COMMAND_TRACK_GET_STATE* cmd)
{
    size_t track;
    uint8_t trackState;

    track = (size_t)cmd->arg.param1.U;

    Track_GetState(track, &trackState);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TRACK_GET_STATE);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = track;
    cmd->arg.param2.U = trackState;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTrackMaskAll(int fd, STC_COMMAND_TRACK_MASK_ALL* cmd)
{
    /* param1 = set mask,
     * param2 = clear mask
     */
    Track_MaskAll((uint8_t)cmd->arg.param1.U, (uint8_t)cmd->arg.param2.U);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TRACK_MASK_ALL);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTrackModeAll(int fd, STC_COMMAND_TRACK_MODE_ALL* cmd)
{
    /* param1 = new transport mode
     * param2 = 0
     */
    Track_SetModeAll((uint8_t)cmd->arg.param1.U);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TRACK_MODE_ALL);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTrackToggleAll(int fd, STC_COMMAND_TRACK_TOGGLE_ALL* cmd)
{
    /* param1 = bit flags to toggle
     * param2 = 0
     */
    Track_ToggleMaskAll((uint8_t)cmd->arg.param1.U);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TRACK_TOGGLE_ALL);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

