rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleZeroReset(int fd, STC_COMMAND_ZERO_RESET* cmd)
{
    PositionZeroReset();

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_ZERO_RESET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleCancel(int fd, STC_COMMAND_CANCEL* cmd)
{
    /* Cancel any locate request active */
    LocateCancel();

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_CANCEL);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTapeSpeedSet(int fd, STC_COMMAND_TAPE_SPEED_SET* cmd)
{
    /* Set transport tape speed */
    Track_SetTapeSpeed((int)cmd->arg.param1.U);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TAPE_SPEED_SET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleConfigEPROM(int fd, STC_COMMAND_CONFIG_EPROM* cmd)
{
    /* param1: 0=load, 1=store, 3=reset
     * param2 = 0
     */
    switch(cmd->arg.param1.U)
    {
    case 0:
        // load STC config data to EPROM */
        ConfigLoad(1);
        break;

    case 1:
        // save STC config data to EPROM */
        ConfigSave(1);
        break;

    case 3:
        // reset STC config data in memory to defaults */
        ConfigReset(1);
        break;

    default:
        break;
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_CONFIG_EPROM);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMonitor(int fd, STC_COMMAND_MONITOR* cmd)
{
    /* Enable standby monitor mode for all tracks */
    g_sys.standbyMonitor = (cmd->arg.param1.U) ? true : false;

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MONITOR);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTrackGetCount(int fd, STC_COMMAND_TRACK_GET_COUNT* cmd)
{
    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TRACK_GET_COUNT);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = g_sys.trackCount;
    cmd->arg.param2.U = g_sys.dcsFound;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMachineConfig(int fd, STC_COMMAND_MACHINE_CONFIG* cmd)
{
    int rc;

    /* This allows the STC to tell the DTC to load, store or
     * reset it configuration parameters to/from EPROM
     */
    switch(cmd->arg.param1.U)
    {
    case 0:
        // load the STC config data
        ConfigLoad(1);
        /* load DTC config */
        rc = IPCToDTC_ConfigEPROM(g_sys.ipcToDTC, 0);
        break;

    case 1:
        // save the STC config data
        ConfigSave(1);
        // save DTC config
        rc = IPCToDTC_ConfigEPROM(g_sys.ipcToDTC, 1);
        break;

    case 2:         /* reset DTC config */
        // reset STC config data to defaults
        ConfigReset(1);
        // reset DTC config data to defaults
        rc = IPCToDTC_ConfigEPROM(g_sys.ipcToDTC, 2);
        break;

    default:
        break;
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MACHINE_CONFIG);
    cmd->hdr.index  = 0;
    cmd->hdr.status = (uint16_t)rc;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMachineConfigGet(int fd, STC_COMMAND_MACHINE_CONFIG_GET* cmd)
{
    int rc = IPC_ERR_SUCCESS;

    /* Gets the STC and DTC configuration parameters struct in memory */
    memset(&(cmd->stc), 0, sizeof(STC_CONFIG_DATA));
    memset(&(cmd->dtc), 0, sizeof(DTC_CONFIG_DATA));

    if (sizeof(STC_CONFIG_DATA) == sizeof(SYSCFG))
    {
        /* Return global STC system config data in the message buffer */
        memcpy(&(cmd->stc), &g_cfg, sizeof(STC_CONFIG_DATA));

        /* Get the DTC config data via IPC from DTC */
        rc = IPCToDTC_ConfigGet(g_sys.ipcToDTC, &cmd->dtc);
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MACHINE_CONFIG_GET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = (uint16_t)rc;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return rc;
}


uint16_t HandleMachineConfigSet(int fd, STC_COMMAND_MACHINE_CONFIG_SET* cmd)
{
    int rc = IPC_ERR_SUCCESS;

    /* Sets the STC and DTC configuration parameters in memory */

    if (sizeof(STC_CONFIG_DATA) == sizeof(SYSCFG))
    {
        /* Copy STC config data into the STC config buffer */
        memcpy(&g_cfg, &(cmd->stc), sizeof(STC_CONFIG_DATA));

        /* Send the DTC new config data via IPC */
        rc = IPCToDTC_ConfigSet(g_sys.ipcToDTC, &cmd->dtc);
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_HDR) + sizeof(STC_COMMAND_ARG);
    cmd->hdr.index  = 0;
    cmd->hdr.status = (uint16_t)rc;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return rc;
}

// End-Of-File
